=======================
Empty Asset Declaration
=======================

category Test {
    asset TestAsset {}
}

-----------------------

(source_file
    (declaration
        (category_declaration
            id: (identity)
            assets: (asset
                        id: (identity)))))

================================
Empty Abstract Asset Declaration
================================

category Test {
    abstract asset TestAsset {}
}

--------------------------------

(source_file
    (declaration
        (category_declaration
            id: (identity)
            assets: (asset
                        id: (identity)))))

=================================
Empty Extending Asset Declaration
=================================

category Test {
    asset TestAsset extends AnotherTestAsset {}
}

---------------------------------

(source_file
    (declaration
        (category_declaration
            id: (identity)
            assets: (asset
                        id: (identity)
                        extends: (identity)))))

==========================================
Empty Extending Abstract Asset Declaration
==========================================


category Test {
    abstract asset TestAsset extends AnotherTestAsset {}
}

------------------------------------------

(source_file
    (declaration
        (category_declaration
            id: (identity)
            assets: (asset
                        id: (identity)
                        extends: (identity)))))

================
Two Empty Assets
================

category Test {
    asset TestAsset {}
    asset AnotherTestAsset {}
}

----------------

(source_file
    (declaration
        (category_declaration
            id: (identity)
            assets: (asset
                        id: (identity))
            assets: (asset
                        id: (identity)))))

======================================
Empty Asset Declaration with Meta Info
======================================

category Test {
    asset TestAsset 
        newLine info: "Meta on new line"
        secondLine info: "Second meta" {}
    asset AnotherTestAsset sameLine info: "Meta on same line" {}
}

--------------------------------------

(source_file
    (declaration
        (category_declaration
            id: (identity)
            assets: (asset
                        id: (identity)
                        meta: (meta
                                id: (identity)
                                info: (string))
                        meta: (meta
                                id: (identity)
                                info: (string)))
            assets: (asset
                         id: (identity)
                         meta: (meta
                                 id: (identity)
                                 info: (string))))))

