============
Line Comment
============

// #id: "com.example.lang"

//no beginning space

// Multiple lines
// asset OperatingSystem
// {
// [OperatingSystem logic]
// }
// 
// asset Linux
// {
// [OperatingSystem + Linux logic]
// }

------------

(source_file
  (comment)
  (comment)
  (comment)
  (comment)
  (comment)
  (comment)
  (comment)
  (comment)
  (comment)
  (comment)
  (comment)
  (comment))

=============
Block Comment
=============

/* #id: "com.example.lang" */

/*no spacing*/

/* Newline before end
*/

/* Multiple lines
 * asset OperatingSystem
 * {
 * [OperatingSystem logic]
 * }
 * 
 * asset Linux
 * {
 * [OperatingSystem + Linux logic]
 * }
 */

-------------

(source_file
  (comment)
  (comment)
  (comment)
  (comment))

=============
Only Comments
=============

// #id: "com.example.lang"

// /* #version: "1.2.3" */

/* // Multiple lines
 * asset OperatingSystem
 * {
 * [OperatingSystem logic]
 * }
 * 
 * asset Linux
 * {
 * [OperatingSystem + Linux logic]
 * }
 */

-------------

(source_file
  (comment)
  (comment)
  (comment))

=========================
Block comment end cut off
=========================

/*
 * This is a block commment
// */

-------------------------

(source_file)

===========================
Block comment start cut off
:error
===========================

// /*
 * This is a block commment
 */

---------------------------


